# RemoveMemberForces Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModelStick..::..RemoveMemberForces Method
AnalyticalModelStick Class See Also
---
Removes member forces defined for given position.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool RemoveMemberForces(
	bool start
)
```

Visual Basic
---
```text
Public Function RemoveMemberForces ( _
	start As Boolean _
) As Boolean
```

Visual C++
---
```text
public:
bool RemoveMemberForces(
	bool start
)
```

# ### Parameters
start
    Type: System..::..Boolean Member Forces position on analytical model stick element. True for start, false for end.
# ### Return Value
True if member forces for provided position were removed, false otherwise.
# See Also
AnalyticalModelStick Class
Autodesk.Revit.DB.Structure Namespace